rails_projects/rails_project_1/app/controllers/artworks_controller.rb

  def create
    art = Artwork.create(artwork_params)
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "RebeccaDrawing"], ["image_url", "www.rebecca.com/drawing"], ["artist_id", 2], ["created_at", "2021-05-21 20:14:55.650584"], ["updated_at", "2021-05-21 20:14:55.650584"]]

  def update
    art = Artwork.find(params[:id])
    art.update_attributes(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "BarbaraPainting1"], ["updated_at", "2021-05-21 19:34:55.075275"], ["id", 11]]

  def destroy
    art = Artwork.find(params[:id])
    art.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 12]]