rails_projects/rails_project_1/app/controllers/artwork_shares_controller.rb

  def create
    share = ArtworkShare.create(artwork_share_params)
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 1]]