rails_projects/rails_project_1/app/controllers/comments_controller.rb

  def index
    case
    when params[:user_id]
      comments =  Comment.where(user_id: params[:user_id])
    when params[:artwork_id]
      comments = Comment.where(artwork_id: params[:artwork_id])
    else
      comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
SELECT "comments".* FROM "comments"

  def create
    comment = Comment.new(comments_params)
    if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["artwork_id", 1], ["body", "I hate your art"], ["created_at", "2021-05-21 23:24:11.705100"], ["updated_at", "2021-05-21 23:24:11.705100"]]