rails_projects/rails_project_1/app/controllers/users_controller.rb

  def index
    if params[:query]
      user = User.where(':username LIKE ?',"%#{params[:query]}")
      render json: user
    else
      render json: User.all
---
SELECT "users".* FROM "users"

  def update
    user = User.find(params[:id])

    if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "libby"], ["email", "libby@internet.com"], ["updated_at", "2021-05-15 19:31:38.055365"], ["id", 6]]